Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_mctm.c
/*********************************************************************************************************//**
 * @file    ht32f12365_66_mctm.c
 * @version $Rev:: 88           $
 * @date    $Date:: 2015-12-11 #$
 * @brief   This file provides all the MCTM firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f12365_66_mctm.h"

/** @addtogroup HT32F12365_66_Peripheral_Driver HT32F12365/12366 Peripheral Driver
  * @{
  */

/** @defgroup MCTM MCTM
  * @brief MCTM driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup MCTM_Private_Define MCTM private definitions
  * @{
  */
#define CNTCFR_UEV1DIS      0x00000001ul
#define CNTCFR_UGDIS        0x00000002ul
#define CNTCFR_DIR          0x01000000ul
#define CNTCFR_CMSEL_MASK   ~0x00030000ul
#define CNTCFR_CKDIV_MASK   ~0x00000300ul

#define MDCFR_SPMSET        0x01000000ul
#define MDCFR_TSE           0x00000001ul
#define MDCFR_SMSEL_MASK    ~0x00000700ul
#define MDCFR_MMSEL_MASK    ~0x00070000ul

#define TRCFR_ECME          0x01000000ul
#define TRCFR_ETI_POL       0x00010000ul
#define TRCFR_ETI_PSC_MASK  ~0x00003000ul
#define TRCFR_ETIF_MASK     ~0x00000F00ul
#define TRCFR_TRSEL_MASK    ~0x0000000Ful
#define TRCFR_ETI_CONF_MASK ~0x00013F00ul

#define CTR_TME             0x00000001ul
#define CTR_CRBE            0x00000002ul
#define CTR_COMPRE          0x00000100ul
#define CTR_COMUS           0x00000200ul
#define CTR_CHCCDS          0x00010000ul

#define CH0ICFR_CH0SRC      0x80000000ul
#define CHICFR_CHF_MASK     ~0x0000000Ful
#define CHICFR_CHCCS_MASK   ~0x00030000ul
#define CHICFR_CHPSC_MASK   ~0x000C0000ul

#define CHOCFR_REFCE        0x00000008ul
#define CHOCFR_CHPRE        0x00000010ul
#define CHOCFR_IMAE         0x00000020ul
#define CHOCFR_CHOM_MASK    ~0x00000107ul

#define CHPOLR_CH0P         0x00000001ul
#define CHPOLR_CH1P         0x00000004ul

#define CHBRKCTR_CHMOE      0x00000010ul
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------------------------------------*/
static void
mctm_CHx_Config(HT_MCTM_TypeDef* MCTMx, MCTM_CH_Enum Ch, MCTM_CHP_Enum Pol, MCTM_CHCCS_Enum Sel, u8 Filter);

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup MCTM_Exported_Functions MCTM exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the MCTMx peripheral registers to their default reset values.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @retval None
 ************************************************************************************************************/
void MCTM_DeInit(HT_MCTM_TypeDef* MCTMx)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  if (MCTMx == HT_MCTM0)
  {
    RSTCUReset.Bit.MCTM0 = 1;
  }
  else
  {
    RSTCUReset.Bit.MCTM1 = 1;
  }

  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Initialize the MCTMx counter to reload, prescaler, counter mode and repetition counter.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param TimeBaseInit: Point to a \ref MCTM_TimeBaseInitTypeDef that contains the configuration information.
 * @retval None
 ************************************************************************************************************/
void MCTM_TimeBaseInit(HT_MCTM_TypeDef* MCTMx, MCTM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CNT_MODE(TimeBaseInit->CounterMode));
  Assert_Param(IS_MCTM_PSC_RLD(TimeBaseInit->PSCReloadTime));

  /* Set the counter reload value                                                                           */
  MCTMx->CRR = TimeBaseInit->CounterReload;

  /* Set the Prescaler value                                                                                */
  MCTMx->PSCR = TimeBaseInit->Prescaler;

  /* Select the Counter Mode                                                                                */
  MCTMx->CNTCFR &= CNTCFR_CMSEL_MASK;        /* CNTCFR_DIR is read only when the timer configured as        */
  MCTMx->CNTCFR &= ~(u32)CNTCFR_DIR;         /* Center-aligned mode. Reset mode first and then reset the    */
                                             /* CNTCFR_DIR bit (separate as two steps).                     */

  MCTMx->CNTCFR |= TimeBaseInit->CounterMode;

  /* Set the Repetition value                                                                               */
  MCTMx->REPR = TimeBaseInit->RepetitionCounter;

  /* To reload the Prescaler value immediatly or next update event 1                                        */
  MCTMx->EVGR = TimeBaseInit->PSCReloadTime;
}

