Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_mctm.c
/*********************************************************************************************************//**
 * @brief Initialize the MCTMx channel N output.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param OutInit: Point to a \ref MCTM_OutputInitTypeDef structure that contains
                   the configuration information.
 * @retval None
 ************************************************************************************************************/
void MCTM_OutputInit(HT_MCTM_TypeDef* MCTMx, MCTM_OutputInitTypeDef* OutInit)
{
  vu32 *pOcfr = (vu32*)&MCTMx->CH0OCFR + OutInit->Channel;
  vu32 *pCcr = (vu32*)&MCTMx->CH0CCR + OutInit->Channel;
  vu32 *pAcr = (vu32*)&MCTMx->CH0ACR + OutInit->Channel;
  u8 bChPos = OutInit->Channel << 1;
  u32 wTmpMask = ~(0x3ul << bChPos);
  u32 wTmpReg;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH(OutInit->Channel));
  Assert_Param(IS_MCTM_OM(OutInit->OutputMode));
  Assert_Param(IS_MCTM_CHCTL(OutInit->Control));
  Assert_Param(IS_MCTM_CHCTL(OutInit->ControlN));
  Assert_Param(IS_MCTM_CHP(OutInit->Polarity));
  Assert_Param(IS_MCTM_CHP(OutInit->PolarityN));
  Assert_Param(IS_MCTM_OIS(OutInit->IdleState));
  Assert_Param(IS_MCTM_OIS(OutInit->IdleStateN));

  /* Disable the Channel                                                                                    */
  MCTMx->CHCTR &= wTmpMask;

  /* Set the Output Compare Polarity                                                                        */
  wTmpReg = MCTMx->CHPOLR & wTmpMask;
  wTmpReg |= (u32)(OutInit->Polarity | (OutInit->PolarityN << 1)) << bChPos;
  MCTMx->CHPOLR = wTmpReg;

  /* Set the Output Idle State                                                                              */
  wTmpReg = MCTMx->CHBRKCFR & wTmpMask;
  wTmpReg |= (u32)(OutInit->IdleState | (OutInit->IdleStateN << 1)) << bChPos;
  MCTMx->CHBRKCFR = wTmpReg;

  /* Select the Output Compare Mode                                                                         */
  *pOcfr &= CHOCFR_CHOM_MASK;
  *pOcfr |= OutInit->OutputMode;

  /* Set the Capture Compare Register value                                                                 */
  *pCcr = OutInit->Compare;

  /* Set the Asymmetric Compare Register value                                                              */
  *pAcr = OutInit->AsymmetricCompare;

  /* Set the channel state                                                                                  */
  MCTMx->CHCTR |= (u32)(OutInit->Control | (OutInit->ControlN << 1)) << bChPos;
}

/*********************************************************************************************************//**
 * @brief Initialize input capture of the MCTMx channel.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param CapInit: Point to a \ref MCTM_CaptureInitTypeDef structure that contains the configuration
 *                information.
 * @retval None
 ************************************************************************************************************/
void MCTM_CaptureInit(HT_MCTM_TypeDef* MCTMx, MCTM_CaptureInitTypeDef* CapInit)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH(CapInit->Channel));
  Assert_Param(IS_MCTM_CHP(CapInit->Polarity));
  Assert_Param(IS_MCTM_CHCCS(CapInit->Selection));
  Assert_Param(IS_MCTM_CHPSC(CapInit->Prescaler));
  Assert_Param(IS_MCTM_FILTER(CapInit->Filter));

  mctm_CHx_Config(MCTMx, CapInit->Channel, CapInit->Polarity, CapInit->Selection, CapInit->Filter);

  /* Set the Input Capture Prescaler value                                                                  */
  MCTM_CHPSCConfig(MCTMx, CapInit->Channel, CapInit->Prescaler);
}

/*********************************************************************************************************//**
 * @brief Configure the MCTMx to measure an external PWM signal.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param CapInit: Point to a \ref MCTM_CaptureInitTypeDef structure that contains the configuration
 *                information.
 * @retval None
 ************************************************************************************************************/
void MCTM_PwmInputInit(HT_MCTM_TypeDef* MCTMx, MCTM_CaptureInitTypeDef* CapInit)
{
  MCTM_CHP_Enum OppositePol;
  MCTM_CHCCS_Enum OppositeSel;
  MCTM_CH_Enum OppositeChannel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH_PWMI(CapInit->Channel));
  Assert_Param(IS_MCTM_CHP(CapInit->Polarity));
  Assert_Param(IS_MCTM_CHCCS(CapInit->Selection));
  Assert_Param(IS_MCTM_CHPSC(CapInit->Prescaler));
  Assert_Param(IS_MCTM_FILTER(CapInit->Filter));

  /* Select the Opposite Input Polarity                                                                     */
  if (CapInit->Polarity == MCTM_CHP_NONINVERTED)
  {
    OppositePol = MCTM_CHP_INVERTED;
  }
  else
  {
    OppositePol = MCTM_CHP_NONINVERTED;
  }

  /* Select the Opposite Input                                                                              */
  if (CapInit->Selection == MCTM_CHCCS_DIRECT)
  {
    OppositeSel = MCTM_CHCCS_INDIRECT;
  }
  else
  {
    OppositeSel = MCTM_CHCCS_DIRECT;
  }

  if (CapInit->Channel == MCTM_CH_0)
  {
    OppositeChannel = MCTM_CH_1;
  }
  else
  {
    OppositeChannel = MCTM_CH_0;
  }

  /* Capture Channel Configuration                                                                          */
  mctm_CHx_Config(MCTMx, CapInit->Channel, CapInit->Polarity, CapInit->Selection, CapInit->Filter);

  /* Set the Input Capture Prescaler value                                                                  */
  MCTM_CHPSCConfig(MCTMx, CapInit->Channel, CapInit->Prescaler);

  /* Opposite Channel Configuration                                                                         */
  mctm_CHx_Config(MCTMx, OppositeChannel, OppositePol, OppositeSel, CapInit->Filter);

  /* Set the Input Capture Prescaler value                                                                  */
  MCTM_CHPSCConfig(MCTMx, OppositeChannel, CapInit->Prescaler);
}

