Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_mctm.c
/*********************************************************************************************************//**
 * @brief Configure output mode of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Channel: Specify the MCTM channel.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CH_0 : MCTM channel 0
 *        @arg MCTM_CH_1 : MCTM channel 1
 *        @arg MCTM_CH_2 : MCTM channel 2
 *        @arg MCTM_CH_3 : MCTM channel 3
 * @param Mod: Specify the MCTM output mode.
 *        This parameter can be one of the following values:
 *        @arg MCTM_OM_MATCH_NOCHANGE  : Output dont change on match
 *        @arg MCTM_OM_MATCH_INACTIVE  : Output inactive on compare match
 *        @arg MCTM_OM_MATCH_ACTIVE    : Output active on compare match
 *        @arg MCTM_OM_MATCH_TOGGLE    : Output toggle on compare match
 *        @arg MCTM_OM_FORCED_INACTIVE : Output forced inactive
 *        @arg MCTM_OM_FORCED_ACTIVE   : Output forced active
 *        @arg MCTM_OM_PWM1            : PWM1 mode
 *        @arg MCTM_OM_PWM2            : PWM2 mode
 *        @arg MCTM_OM_ASYMMETRIC_PWM1 : Asymmetric PWM1 mode
 *        @arg MCTM_OM_ASYMMETRIC_PWM2 : Asymmetric PWM2 mode
 * @retval None
 * @note This function disables the selected channel before changing the output mode.
 ************************************************************************************************************/
void MCTM_OutputModeConfig(HT_MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_OM_Enum Mod)
{
  vu32 *pOcfr = (vu32*)&MCTMx->CH0OCFR + Channel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH(Channel));
  Assert_Param(IS_MCTM_OM(Mod));

  /* Disable the channel: Reset the CHxE Bit                                                                */
  MCTMx->CHCTR &= ~(u32)(0x1 << (Channel << 1));

  /* Selects the MCTM output mode                                                                           */
  *pOcfr = (*pOcfr & CHOCFR_CHOM_MASK) | Mod;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable update event of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE(default) or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_UpdateCmd(HT_MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState == DISABLE)
  {
    /* Set the update disable bit                                                                           */
    MCTMx->CNTCFR |= CNTCFR_UEV1DIS;
  }
  else
  {
    /* Reset the update disable bit                                                                         */
    MCTMx->CNTCFR &= ~CNTCFR_UEV1DIS;
  }
}

/*********************************************************************************************************//**
 * @brief Configure UEV1G interrupt function of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be one of the following value:
 *    @arg ENABLE  : Default value. Any of the following events will generate an update event 1 interrupt:
 *                   - Counter overflow/underflow
 *                   - Setting the UEV1G bit
 *                   - Update generation through the slave restart mode
 *    @arg DISABLE : Only counter overflow/underflow generations an update event 1 interrupt.
 * @retval None
 ************************************************************************************************************/
void MCTM_UEV1G_IntConfig(HT_MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState == DISABLE)
  {
    /* Set the UEV1G interrupt disable bit                                                                  */
    MCTMx->CNTCFR |= CNTCFR_UGDIS;
  }
  else
  {
    /* Reset the UEV1G interrupt disable bit                                                                */
    MCTMx->CNTCFR &= ~CNTCFR_UGDIS;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable hall sensor interface of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_HallInterfaceCmd(HT_MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CH0SRC Bit                                                                                   */
    MCTMx->CH0ICFR |= CH0ICFR_CH0SRC;
  }
  else
  {
    /* Reset the CH0SRC Bit                                                                                 */
    MCTMx->CH0ICFR &= ~CH0ICFR_CH0SRC;
  }
}

/*********************************************************************************************************//**
 * @brief Select single pulse mode of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_SinglePulseModeCmd(HT_MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MCTMx->MDCFR |= MDCFR_SPMSET;
  }
  else
  {
    MCTMx->MDCFR &= ~MDCFR_SPMSET;
  }
}

