Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_mctm.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH(Channel));
  Assert_Param(IS_MCTM_CHPSC(Psc));

  /* Reset the CHxPSC bits                                                                                  */
  *pIcfr &= CHICFR_CHPSC_MASK;

  /* Set the capture input prescaler value                                                                  */
  *pIcfr |= Psc;
}

/*********************************************************************************************************//**
 * @brief Set clock division value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Div: Specify the clock division value.
 *        This parameter can be one of the following value:
 *        @arg MCTM_CKDIV_OFF : fDTS = fCLKIN
 *        @arg MCTM_CKDIV_2   : fDTS = fCLKIN / 2
 *        @arg MCTM_CKDIV_4   : fDTS = fCLKIN / 4
 * @retval None
 ************************************************************************************************************/
void MCTM_CKDIVConfig(HT_MCTM_TypeDef* MCTMx, MCTM_CKDIV_Enum Div)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CKDIV(Div));

  /* Reset the CKDIV Bits                                                                                   */
  MCTMx->CNTCFR &= CNTCFR_CKDIV_MASK;

  /* Set the CKDIV value                                                                                    */
  MCTMx->CNTCFR |= Div;
}

/*********************************************************************************************************//**
 * @brief Get channel 0 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH0CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare0(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH0CCR register value                                                                          */
  return MCTMx->CH0CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 1 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH1CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare1(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH1CCR register value                                                                          */
  return MCTMx->CH1CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 2 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH2CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare2(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH2CCR register value                                                                          */
  return MCTMx->CH2CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 3 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH3CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare3(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH3CCR register value                                                                          */
  return MCTMx->CH3CCR;
}

/*********************************************************************************************************//**
 * @brief Get counter value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of Counter register
 ************************************************************************************************************/
u32 MCTM_GetCounter(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the Counter Register value                                                                         */
  return MCTMx->CNTR;
}

/*********************************************************************************************************//**
 * @brief Get prescaler value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of Prescaler register
 ************************************************************************************************************/
u32 MCTM_GetPrescaler(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the Prescaler Register value                                                                       */
  return MCTMx->PSCR;
}

