Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_mctm.c
/*********************************************************************************************************//**
 * @brief Check whether the MCTMx interrupt has occurred.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param MCTM_INT: Specify the MCTM interrupt source to be checked.
 *        This parameter can be one of the following values:
 *        @arg MCTM_INT_CH0CC     : MCTM Capture/compare 0 interrupt
 *        @arg MCTM_INT_CH1CC     : MCTM Capture/compare 1 interrupt
 *        @arg MCTM_INT_CH2CC     : MCTM Capture/compare 2 interrupt
 *        @arg MCTM_INT_CH3CC     : MCTM Capture/compare 3 interrupt
 *        @arg MCTM_INT_UEV1      : MCTM update 1 interrupt
 *        @arg MCTM_INT_UEV2      : MCTM update 2 interrupt
 *        @arg MCTM_INT_TEV       : MCTM trigger interrupt
 *        @arg MCTM_INT_BRKEV     : MCTM break interrupt
 * @return The new state of the MCTM_INT(SET or RESET)
 ************************************************************************************************************/
FlagStatus MCTM_GetIntStatus(HT_MCTM_TypeDef* MCTMx, u32 MCTM_INT)
{
  u32 itstatus, itenable;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_GET_INT(MCTM_INT));

  itstatus = MCTMx->INTSR & MCTM_INT;
  itenable = MCTMx->DICTR & MCTM_INT;

  if ((itstatus != 0) && (itenable != 0))
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear interrupt pending bits of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param MCTM_INT: Specify the MCTM interrupt to be cleared.
 *        This parameter can be any combination of the following values:
 *        @arg MCTM_INT_CH0CC     : MCTM Capture/compare 0 interrupt
 *        @arg MCTM_INT_CH1CC     : MCTM Capture/compare 1 interrupt
 *        @arg MCTM_INT_CH2CC     : MCTM Capture/compare 2 interrupt
 *        @arg MCTM_INT_CH3CC     : MCTM Capture/compare 3 interrupt
 *        @arg MCTM_INT_UEV1      : MCTM update 1 interrupt
 *        @arg MCTM_INT_UEV2      : MCTM update 2 interrupt
 *        @arg MCTM_INT_TEV       : MCTM trigger interrupt
 *        @arg MCTM_INT_BRKEV     : MCTM break interrupt
 * @retval None
 ************************************************************************************************************/
void MCTM_ClearIntPendingBit(HT_MCTM_TypeDef* MCTMx, u32 MCTM_INT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_INT(MCTM_INT));

  /* Clear the interrupt pending Bit                                                                        */
  MCTMx->INTSR = ~MCTM_INT;

  /*--------------------------------------------------------------------------------------------------------*/
  /* DSB instruction is added in this function to ensure the write operation which is for clearing interrupt*/
  /* flag is actually completed before exiting ISR. It prevents the NVIC from detecting the interrupt again */
  /* since the write register operation may be pended in the internal write buffer of Cortex-M3 when program*/
  /* has exited interrupt routine. This DSB instruction may be masked if this function is called in the     */
  /* beginning of ISR and there are still some instructions before exiting ISR.                             */
  /*--------------------------------------------------------------------------------------------------------*/
  __DSB();
}

/*********************************************************************************************************//**
 * @brief Disable slave mode to clock the prescaler directly with the internal clock.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @retval None
 ************************************************************************************************************/
void MCTM_InternalClockConfig(HT_MCTM_TypeDef* MCTMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));

  /* Disable slave mode to clock the prescaler directly with the internal clock                             */
  MCTMx->MDCFR &= MDCFR_SMSEL_MASK;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the channels main output of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_CHMOECmd(HT_MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the MCTM Main Output                                                                          */
    MCTMx->CHBRKCTR |= CHBRKCTR_CHMOE;
  }
  else
  {
    /* Disable the MCTM Main Output                                                                         */
    MCTMx->CHBRKCTR &= ~CHBRKCTR_CHMOE;
  }
}

/*********************************************************************************************************//**
 * @brief Configure the break feature, dead time, Lock level, the OSSI, the OSSR State
 *        and the CHAOE(automatic output enable).
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param CHBRKCTRInit: Point to a MCTM_CHBRKCTRInitTypeDef structure that contains
 *        the CHBRKCTR Register configuration information for the MCTM peripheral.
 * @retval None
 ************************************************************************************************************/
void MCTM_CHBRKCTRConfig(HT_MCTM_TypeDef* MCTMx, MCTM_CHBRKCTRInitTypeDef *CHBRKCTRInit)
{
  u32 wTmpReg;

