Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/src/ht32f12365_66_mctm.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_OSSR_STATE(CHBRKCTRInit->OSSRState));
  Assert_Param(IS_MCTM_OSSI_STATE(CHBRKCTRInit->OSSIState));
  Assert_Param(IS_MCTM_LOCK_LEVEL(CHBRKCTRInit->LockLevel));
  Assert_Param(IS_MCTM_BREAK_STATE(CHBRKCTRInit->Break0));
  Assert_Param(IS_MCTM_BREAK_POLARITY(CHBRKCTRInit->Break0Polarity));
  Assert_Param(IS_MCTM_BREAK_STATE(CHBRKCTRInit->Break1));
  Assert_Param(IS_MCTM_BREAK_POLARITY(CHBRKCTRInit->Break1Polarity));
  Assert_Param(IS_MCTM_CHAOE_STATE(CHBRKCTRInit->AutomaticOutput));
  Assert_Param(IS_MCTM_FILTER(CHBRKCTRInit->BreakFilter));

  wTmpReg = (u32)CHBRKCTRInit->BreakFilter << 8;
  wTmpReg |= (u32)CHBRKCTRInit->DeadTime << 24;
  wTmpReg |= CHBRKCTRInit->LockLevel | CHBRKCTRInit->OSSRState | CHBRKCTRInit->OSSIState;
  wTmpReg |= CHBRKCTRInit->Break0 | CHBRKCTRInit->Break0Polarity | CHBRKCTRInit->AutomaticOutput;
  wTmpReg |= (CHBRKCTRInit->Break1 << 2) | (CHBRKCTRInit->Break1Polarity << 2);

  MCTMx->CHBRKCTR = wTmpReg;
}

/*********************************************************************************************************//**
 * @brief Fill each CHBRKCTRInitStruct member with its default value.
 * @param CHBRKCTRInitStruct: Point to a \ref MCTM_CHBRKCTRInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void MCTM_CHBRKCTRStructInit(MCTM_CHBRKCTRInitTypeDef* CHBRKCTRInitStruct)
{
  /* Set the default configuration                                                                          */
  CHBRKCTRInitStruct->OSSRState = MCTM_OSSR_STATE_DISABLE;
  CHBRKCTRInitStruct->OSSIState = MCTM_OSSI_STATE_DISABLE;
  CHBRKCTRInitStruct->LockLevel = MCTM_LOCK_LEVEL_OFF;
  CHBRKCTRInitStruct->DeadTime = 0x00;
  CHBRKCTRInitStruct->Break0 = MCTM_BREAK_DISABLE;
  CHBRKCTRInitStruct->Break0Polarity = MCTM_BREAK_POLARITY_LOW;
  CHBRKCTRInitStruct->Break1 = MCTM_BREAK_DISABLE;
  CHBRKCTRInitStruct->Break1Polarity = MCTM_BREAK_POLARITY_LOW;
  CHBRKCTRInitStruct->BreakFilter = 0;
  CHBRKCTRInitStruct->AutomaticOutput = MCTM_CHAOE_DISABLE;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable MCTMx COMPRE function.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_COMPRECmd(HT_MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the MCTM COMPRE                                                                               */
    MCTMx->CTR |= CTR_COMPRE;
  }
  else
  {
    /* Disable the MCTM COMPRE                                                                              */
    MCTMx->CTR &= ~CTR_COMPRE;
  }
}

/*********************************************************************************************************//**
 * @brief Configure the MCTMx COMUS function.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Sel: Specify the COMUS value.
 *        This parameter can be one of the following value:
 *        @arg MCTM_COMUS_STIOFF : MCTM capture/compare control bits are updated by
 *             setting the UEV2G bit only
 *        @arg MCTM_COMUS_STION  : MCTM capture/compare control bits are updated by both
 *             setting the UEV2G bit or when a rising edge occurs on STI
 * @retval None
 ************************************************************************************************************/
void MCTM_COMUSConfig(HT_MCTM_TypeDef* MCTMx, MCTM_COMUS_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_COMUS(Sel));

  if (Sel != MCTM_COMUS_STIOFF)
  {
    /* Set the MCTM COMUS bit                                                                               */
    MCTMx->CTR |= CTR_COMUS;
  }
  else
  {
    /* Clear the MCTM COMUS bit                                                                             */
    MCTMx->CTR &= ~CTR_COMUS;
  }
}

/*********************************************************************************************************//**
 * @brief Select Channel Capture/Compare PDMA event of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Selection: This parameter can be MCTM_CHCCDS_CHCCEV or MCTM_CHCCDS_UEV1.
 * @retval None
 ************************************************************************************************************/
void MCTM_CHCCDSConfig(HT_MCTM_TypeDef* MCTMx, MCTM_CHCCDS_Enum Selection)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CHCCDS(Selection));

  if (Selection != MCTM_CHCCDS_CHCCEV)
  {
    MCTMx->CTR |= CTR_CHCCDS;
  }
  else
  {
    MCTMx->CTR &= ~CTR_CHCCDS;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified PDMA requests of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param MCTM_PDMA: Specify the MCTM PDMA requests to be enabled or disabled.
 *        This parameter can be any combination of the following values:
 *        @arg MCTM_PDMA_CH0CC     : MCTM Capture/compare 0 PDMA request
 *        @arg MCTM_PDMA_CH1CC     : MCTM Capture/compare 1 PDMA request
 *        @arg MCTM_PDMA_CH2CC     : MCTM Capture/compare 2 PDMA request
 *        @arg MCTM_PDMA_CH3CC     : MCTM Capture/compare 3 PDMA request
 *        @arg MCTM_PDMA_UEV1      : MCTM update 1 PDMA request
 *        @arg MCTM_PDMA_UEV2      : MCTM update 2 PDMA request
 *        @arg MCTM_PDMA_TEV       : MCTM trigger PDMA request
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_PDMAConfig(HT_MCTM_TypeDef* MCTMx, u32 MCTM_PDMA, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_PDMA(MCTM_PDMA));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the PDMA request                                                                              */
    MCTMx->DICTR |= MCTM_PDMA;
  }
  else
  {
    /* Disable the PDMA request                                                                             */
    MCTMx->DICTR &= ~MCTM_PDMA;
  }
}
/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup MCTM_Private_Functions MCTM private functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Configure the CHx as input.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Ch: Specify the MCTM Channel.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CH_0 : MCTM channel 0
 *        @arg MCTM_CH_1 : MCTM channel 1
 *        @arg MCTM_CH_2 : MCTM channel 2
 *        @arg MCTM_CH_3 : MCTM channel 3
 * @param Pol: The input polarity.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg MCTM_CHP_INVERTED    : Active low level or falling edge
 * @param Sel: Specify the input to be used.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CHCCS_DIRECT   : MCTM CHxI is mapped on CHx.
 *        @arg MCTM_CHCCS_INDIRECT : MCTM CH1I is mapped on CH0 (or CH0I->CH1 or CH2I->CH3 or CH3I->CH2).
 *        @arg MCTM_CHCCS_TRCED    : MCTM CHx is mapped on TRC.
 * @param Filter: Specify the input capture filter.
 *        This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 ************************************************************************************************************/
static void
mctm_CHx_Config(HT_MCTM_TypeDef* MCTMx, MCTM_CH_Enum Ch, MCTM_CHP_Enum Pol, MCTM_CHCCS_Enum Sel, u8 Filter)
{
  vu32* pIcfr = (vu32*)&MCTMx->CH0ICFR + Ch;
  u32 wIcfr, wChpolr;

  /* Disable the channel N: reset the CHxE bit                                                              */
  MCTMx->CHCTR &= ~((u32)0x1 << (Ch << 1));

  wIcfr = *pIcfr;
  wChpolr = MCTMx->CHPOLR;

  /* Select the input and set the filter                                                                    */
  wIcfr &= CHICFR_CHCCS_MASK & CHICFR_CHF_MASK;
  wIcfr |= Sel | Filter;
  *pIcfr = wIcfr;

  /* Select the polarity bit                                                                                */
  wChpolr &= ~((u32)0x1 << (Ch << 1));
  wChpolr |= (u32)Pol << (Ch << 1);
  MCTMx->CHPOLR = wChpolr;

  /* Set the CHxE Bit                                                                                       */
  MCTMx->CHCTR |= (u32)0x1 << (Ch << 1);
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
